In [1]:
import pandas as pd

In [2]:
pd.Series(['banana',42])

0    banana
1        42
dtype: object

In [4]:
pd.Series(['banana',42],index=['name','age'],name='kind')

name    banana
age         42
Name: kind, dtype: object

In [6]:
pd.DataFrame({
    'Name':['Framklin','Gosset'],
    'Born':['1920-07-25','1876-06-03'],
    'Age':[37,61]
})

       Name        Born  Age
0  Framklin  1920-07-25   37
1    Gosset  1876-06-03   61

In [8]:
pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]],
             columns=['a', 'b', 'c'])

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [10]:
df =  pd.read_csv('data/scientists.csv')